#include "parameter.h"




// 精确延时变量
//u16 delay_1ms = 1;
//u16 delay_1ms_flag;
u16 plc_delay_1ms = 1;
u16 plc_delay_1ms_flag = 0;

//参数表
const s16 parameter_table_default[MEAU_NUM] =
{     
     315,                               // 0密码
     0,                                // 1型号
     260,                        // 2软件版本
     0,                         // 3初始显示状态
     0,                            // 4控制方式------0位置 2速度试运行
     13,                              // 5速度增益
     600,                          // 6速度积分
     20,                           // 7转矩指令滤波器
     100,                       // 8速度检测滤波器
     100,                           // 9位置增益
     0,                // 10位置前馈增益
     1,     // 11位置前馈滤波器截止频率
     100,       // 12位置指令脉冲分频分子
     100,     // 13位置指令脉冲分频分母
     0,                    // 14位置指令脉冲输入方式
     0,               // 15位置指令脉冲方向
     20,                    // 16定位完成范围
     400,        // 17位置超差检测范围
     0,            // 18位置超差错误范围
     0,                  // 19位置指令滤波器
     0,                  // 20驱动禁止输入无效
     120,                               // 21JOG运行速度
     0,                     // 22内外速度指令选择
     3600,                               // 23 最高速度限制
     100,                         // 24内部速度1
     500,                         // 25内部速度2
     -500,                         // 26内部速度3
     -100,                         // 27内部速度4
     500,                           // 28到达速度
     10,                       // 29模拟量转矩指令输入增益
     300,                // 30用户转矩过载报警
     10,           // 31用户转矩过载报警检测时间
     0,                // 32控制方式切换允许
     0,    // 33模拟量转矩指令方向取反
     300,                 // 34内部CCW转矩限制
     -300,                  // 35内部CW转矩限制
     150,                 // 36外部CCW转矩限制
     -150,                  // 37外部CW转矩限制
     100,                         // 38速度试运行、JOG运行转矩限制
     0,  // 39模拟转矩指令零偏补偿
     10,               // 40加速时间常数
     10,               // 41减速时间常数
     1, //42S型加减速时间常数
     10,                        // 43模拟量速度指令输入增益
     0,     // 44模拟量速度指令方向取反
     0,   // 45模拟转速度令零偏补偿
     100,               // 46模拟速度指令滤波
     0,          // 47电机停止时机械制动器动作设定
     50,           // 48电机运转时机械制动器动作设定
     100,        // 49电机运转时机械制动器动作速度
     3000,           // 50转矩控制室速度限制;
     0,                    // 51动态电子齿轮有效
     1, // 52第二位置指令脉冲分频分子
     0,                       // 53低四位输入端子强制ON控制字
     0,                       // 54高四位输入端子强制ON控制字
     0,                  // 55低四位输入端子取反控制字
     0,                  // 56高四位输入端子取反控制字
     0,                          // 57输出端子取反控制字;
     1,                            // 58输入端子去抖时间常数;
     0,                                   // 59演示
     20,                            // 60电流增益;
     350,                                   // 61电流积分;
     500,                                   // 62过压报警时间;
     50,                                   // 63过电流报警时间;
     150,                                   // 64热过载报警阀值;
     3600,                                   // 65热过载报警时间;
     10000,                                   // 66速度PID饱和报警时间;
     2000,                                   // 67制动报警时间;
     0,                                   // 68报警屏蔽1-6 ;
     0,                                   // 69报警屏蔽7-12;
     0,                                   // 70报警屏蔽13-18;
     0,                                   // 71报警屏蔽19-24;
     0,                                   // 72报警屏蔽25-30;
     0,                                   // 73报警屏蔽31-36;
     0,                                   // 74
     0,                                   // 75
     0,                                   // 76
     0,                                   // 77
     0,                                   // 78
     0                                   // 79
};

s16 parameter_table[MEAU_NUM] =
{     
     315,                               // 0密码
     0,                                // 1型号
     260,                        // 2软件版本
     0,                         // 3初始显示状态
     0,                            // 4控制方式------0位置 2速度试运行
     13,                              // 5速度增益
     600,                          // 6速度积分
     20,                           // 7转矩指令滤波器
     100,                       // 8速度检测滤波器
     100,                           // 9位置增益
     0,                // 10位置前馈增益
     1,     // 11位置前馈滤波器截止频率
     100,       // 12位置指令脉冲分频分子
     100,     // 13位置指令脉冲分频分母
     0,                    // 14位置指令脉冲输入方式
     0,               // 15位置指令脉冲方向
     20,                    // 16定位完成范围
     400,        // 17位置超差检测范围
     0,            // 18位置超差错误范围
     0,                  // 19位置指令滤波器
     0,                  // 20驱动禁止输入无效
     120,                               // 21JOG运行速度
     0,                     // 22内外速度指令选择
     3600,                               // 23 最高速度限制
     100,                         // 24内部速度1
     500,                         // 25内部速度2
     -500,                         // 26内部速度3
     -100,                         // 27内部速度4
     500,                           // 28到达速度
     10,                       // 29模拟量转矩指令输入增益
     300,                // 30用户转矩过载报警
     10,           // 31用户转矩过载报警检测时间
     0,                // 32控制方式切换允许
     0,    // 33模拟量转矩指令方向取反
     300,                 // 34内部CCW转矩限制
     -300,                  // 35内部CW转矩限制
     150,                 // 36外部CCW转矩限制
     -150,                  // 37外部CW转矩限制
     100,                         // 38速度试运行、JOG运行转矩限制
     0,  // 39模拟转矩指令零偏补偿
     10,               // 40加速时间常数
     10,               // 41减速时间常数
     1, //42S型加减速时间常数
     10,                        // 43模拟量速度指令输入增益
     0,     // 44模拟量速度指令方向取反
     0,   // 45模拟转速度令零偏补偿
     100,               // 46模拟速度指令滤波
     0,          // 47电机停止时机械制动器动作设定
     50,           // 48电机运转时机械制动器动作设定
     100,        // 49电机运转时机械制动器动作速度
     3000,           // 50转矩控制室速度限制;
     0,                    // 51动态电子齿轮有效
     1, // 52第二位置指令脉冲分频分子
     0,                       // 53低四位输入端子强制ON控制字
     0,                       // 54高四位输入端子强制ON控制字
     0,                  // 55低四位输入端子取反控制字
     0,                  // 56高四位输入端子取反控制字
     0,                          // 57输出端子取反控制字;
     1,                            // 58输入端子去抖时间常数;
     0,                                   // 59演示
     20,                            // 60电流增益;
     350,                                   // 61电流积分;
     500,                                   // 62过压报警时间;
     50,                                   // 63过电流报警时间;
     150,                                   // 64热过载报警阀值;
     3600,                                   // 65热过载报警时间;
     10000,                                   // 66速度PID饱和报警时间;
     2000,                                   // 67制动报警时间;
     0,                                   // 68报警屏蔽1-6 ;
     0,                                   // 69报警屏蔽7-12;
     0,                                   // 70报警屏蔽13-18;
     0,                                   // 71报警屏蔽19-24;
     0,                                   // 72报警屏蔽25-30;
     0,                                   // 73报警屏蔽31-36;
     0,                                   // 74
     0,                                   // 75
     0,                                   // 76
     0,                                   // 77
     0,                                   // 78
     0                                   // 79
};

s16 parameter_table_max[MEAU_NUM] =
{
          9999,                               // 0密码
          MOTOR_NUM-1,                                // 1型号
          1000,                        // 2软件版本
          21,                         // 3初始显示状态
          3,                            // 4控制方式
          1000,                              // 5速度增益
          10000,                          // 6速度积分
          200,                           // 7转矩指令滤波器 500Hz
          2000,                          // 8速度检测滤波器 50Hz
          2000,                           // 9位置增益
          2000,                // 10位置前馈增益
          1200,     // 11位置前馈滤波器截止频率
          1000,       // 12位置指令脉冲分频分子
          1000,     // 13位置指令脉冲分频分母
          2,                    // 14位置指令脉冲输入方式
          1,               // 15位置指令脉冲方向
          30000,                    // 16定位完成范围
          5000,        // 17位置超差检测范围
          1,            // 18位置超差错误范围
          30000,                  // 19位置指令滤波器
          1,                  // 20驱动禁止输入无效
          2000,                               // 21JOG运行速度
          2,                     // 22内外速度指令选择
          4000,                               // 23 最高速度限制
          3000,                         // 24内部速度1
          3000,                         // 25内部速度2
          3000,                         // 26内部速度3
          3000,                         // 27内部速度4
          3000,                           // 28到达速度
          100,                       // 29模拟量转矩指令输入增益
          300,                // 30用户转矩过载报警
          32767,           // 31用户转矩过载报警检测时间
          1,                // 32控制方式切换允许
          1,    // 33模拟量转矩指令方向取反
          300,                 // 34内部CCW转矩限制
          0,                  // 35内部CW转矩限制
          300,                 // 36外部CCW转矩限制
          0,                  // 37外部CW转矩限制
          300,                         // 38速度试运行、JOG运行转矩限制
          200,  // 39模拟转矩指令零偏补偿
          10000,               // 40加速时间常数
          10000,               // 41减速时间常数
          1000, //42S型加减速时间常数
          3000,                        // 43模拟量速度指令输入增益
          1,     // 44模拟量速度指令方向取反
          1000,   // 45模拟转速度令零偏补偿
          2000,               // 46模拟速度指令滤波  50Hz
          200,          // 47电机停止时机械制动器动作设定
          200,           // 48电机运转时机械制动器动作设定
          3000,        // 49电机运转时机械制动器动作速度
          5000,           // 50转矩控制室速度限制;
          1,                    // 51动态电子齿轮有效
          32767, // 52第二位置指令脉冲分频分子
          15,                       // 53低四位输入端子强制ON控制字
          15,                       // 54高四位输入端子强制ON控制字
          15,                  // 55低四位输入端子取反控制字
          15,                  // 56高四位输入端子取反控制字
          15,                          // 57输出端子取反控制字;
          1000,                            // 58输入端子去抖时间常数;
          1,                                   // 59演示
          200,                            // 60电流增益;
          2000,                                   // 61电流积分;
          10000,                                   // 62过压报警时间;
          1000,                                   // 63过电流报警时间;
          300,                                   // 64热过载报警阀值;
          30000,                                   // 65热过载报警时间;
          10000,                                   // 66速度PID饱和报警时间;
          10000,                                   // 67制动报警时间;
          63,                                   // 68报警屏蔽1-6 ;
          63,                                   // 69报警屏蔽7-12;
          63,                                   // 70报警屏蔽13-18;
          63,                                   // 71报警屏蔽19-24;
          63,                                   // 72报警屏蔽25-30;
          63,                                  // 73报警屏蔽31-36;
          0,                                   // 74
          0,                                   // 75
          0,                                   // 76
          0,                                   // 77
          0,                                   // 78
          0                                   // 79
};
s16 parameter_table_min[MEAU_NUM] =
{
          0,                               // 0密码
          0,                                // 1型号
          0,                        // 2软件版本
          0,                         // 3初始显示状态
          0,                            // 4控制方式
          1,                              // 5速度增益
          1,                          // 6速度积分
          1,                           // 7转矩指令滤波器
          1,                       // 8速度检测滤波器
          1,                           // 9位置增益
          0,                // 10位置前馈增益
          1,     // 11位置前馈滤波器截止频率
          1,       // 12位置指令脉冲分频分子
          1,     // 13位置指令脉冲分频分母
          0,                    // 14位置指令脉冲输入方式
          0,               // 15位置指令脉冲方向
          1,                    // 16定位完成范围
          1,        // 17位置超差检测范围
          0,            // 18位置超差错误范围
          0,                  // 19位置指令滤波器
          0,                  // 20驱动禁止输入无效
          -2000,                               // 21JOG运行速度
          0,                     // 22内外速度指令选择
          0,                               // 23 最高速度限制
          -3000,                         // 24内部速度1
          -3000,                         // 25内部速度2
          -3000,                         // 26内部速度3
          -3000,                         // 27内部速度4
          0,                           // 28到达速度
          1,                       // 29模拟量转矩指令输入增益
          1,                // 30用户转矩过载报警
          0,           // 31用户转矩过载报警检测时间
          0,                // 32控制方式切换允许
          0,    // 33模拟量转矩指令方向取反
          0,                 // 34内部CCW转矩限制
          -300,                  // 35内部CW转矩限制
          0,                 // 36外部CCW转矩限制
          -300,                  // 37外部CW转矩限制
          0,                         // 38速度试运行、JOG运行转矩限制
          -2000,  // 39模拟转矩指令零偏补偿
          1,               // 40加速时间常数
          1,               // 41减速时间常数
          1, //42S型加减速时间常数
          10,                        // 43模拟量速度指令输入增益
          0,     // 44模拟量速度指令方向取反
          -1000,   // 45模拟转速度令零偏补偿
          1,               // 46模拟速度指令滤波
          0,          // 47电机停止时机械制动器动作设定
          0,           // 48电机运转时机械制动器动作设定
          0,        // 49电机运转时机械制动器动作速度
          0,           // 50转矩控制室速度限制;
          0,                    // 51动态电子齿轮有效
          1, // 52第二位置指令脉冲分频分子
          0,                       // 53低四位输入端子强制ON控制字
          0,                       // 54高四位输入端子强制ON控制字
          0,                  // 55低四位输入端子取反控制字
          0,                  // 56高四位输入端子取反控制字
          0,                          // 57输出端子取反控制字;
          1,                            // 58输入端子去抖时间常数;
          0,                                   // 59演示
          1,                            // 60电流增益;
          1,                                   // 61电流积分;               
          10,                                   // 62过压报警时间;
          1,                                  // 63过电流报警时间;
          100,                                   // 64热过载报警阀值;
          0,                                   // 65热过载报警时间;
          0,                                   // 66速度PID饱和报警时间;
          10,                                   // 67制动报警时间;
          0,                                   // 68报警屏蔽1-6 ;
          0,                                   // 69报警屏蔽7-12;
          0,                                   // 70报警屏蔽13-18;
          0,                                   // 71报警屏蔽19-24;
          0,                                   // 72报警屏蔽25-30;
          0,                                   // 73报警屏蔽31-36;
          0,                                   // 74
          0,                                   // 75
          0,                                   // 76
          0,                                   // 77
          0,                                   // 78
          0                                   // 79
};
s16 parameter_table_step[MEAU_NUM] =
{
          1,                               // 0密码
          1,                                // 1型号
          1,                        // 2软件版本
          1,                         // 3初始显示状态
          1,                            // 4控制方式
          1,                              // 5速度增益
          1,                          // 6速度积分
          1,                           // 7转矩指令滤波器
          1,                       // 8速度检测滤波器
          1,                           // 9位置增益
          1,                // 10位置前馈增益
          1,     // 11位置前馈滤波器截止频率
          1,       // 12位置指令脉冲分频分子
          1,     // 13位置指令脉冲分频分母
          1,                    // 14位置指令脉冲输入方式
          1,               // 15位置指令脉冲方向
          1,                    // 16定位完成范围
          1,        // 17位置超差检测范围
          1,            // 18位置超差错误范围
          1,                  // 19位置指令滤波器
          1,                  // 20驱动禁止输入无效
          1,                               // 21JOG运行速度
          1,                     // 22内外速度指令选择
          10,                               // 23 最高速度限制
          1,                         // 24内部速度1
          1,                         // 25内部速度2
          1,                         // 26内部速度3
          1,                         // 27内部速度4
          10,                           // 28到达速度
          1,                       // 29模拟量转矩指令输入增益
          1,                // 30用户转矩过载报警
          10,           // 31用户转矩过载报警检测时间
          1,                // 32控制方式切换允许
          1,    // 33模拟量转矩指令方向取反
          1,                 // 34内部CCW转矩限制
          1,                  // 35内部CW转矩限制
          1,                 // 36外部CCW转矩限制
          1,                  // 37外部CW转矩限制
          1,                         // 38速度试运行、JOG运行转矩限制
          1,  // 39模拟转矩指令零偏补偿
          1,               // 40加速时间常数
          1,               // 41减速时间常数
          10, //42S型加减速时间常数
          1,                        // 43模拟量速度指令输入增益
          1,     // 44模拟量速度指令方向取反
          1,   // 45模拟转速度令零偏补偿
          1,               // 46模拟速度指令滤波
          1,          // 47电机停止时机械制动器动作设定
          1,           // 48电机运转时机械制动器动作设定
          5,        // 49电机运转时机械制动器动作速度
          5,           // 50转矩控制室速度限制;
          1,                    // 51动态电子齿轮有效
          1, // 52第二位置指令脉冲分频分子
          1,                       // 53低四位输入端子强制ON控制字
          1,                       // 54高四位输入端子强制ON控制字
          1,                  // 55低四位输入端子取反控制字
          1,                  // 56高四位输入端子取反控制字
          1,                          // 57输出端子取反控制字;
          5,                            // 58输入端子去抖时间常数;
          1,                                   // 59演示
          1,                            // 60电流增益;
          1,                                   // 61电流积分;
          1,                                   // 62过压报警时间;
          1,                                   // 63过电流报警时间;
          1,                                   // 64热过载报警阀值;
          1,                                   // 65热过载报警时间;
          1,                                   // 66速度PID饱和报警时间;
          1,                                   // 67制动报警时间;
          1,                                   // 68报警屏蔽1-6 ;
          1,                                   // 69报警屏蔽7-12;
          1,                                   // 70报警屏蔽13-18;
          1,                                   // 71报警屏蔽19-24;
          1,                                   // 72报警屏蔽25-30;
          1,                                   // 73报警屏蔽31-36;
          0,                                   // 74
          0,                                   // 75
          0,                                   // 76
          0,                                   // 77
          0,                                   // 78
          0                                   // 79
};



void motor_parameter_read(void)
{
     parameter_table[InteriorCCWTorqueLimit] = motor_parameter[parameter_table[Version]].Max_Torque;
     parameter_table[InteriorCWTorqueLimit] = -motor_parameter[parameter_table[Version]].Max_Torque;
     parameter_table[SpeedLimitWhileTorqueControl] = motor_parameter[parameter_table[Version]].Max_Speed;
     parameter_table[CurrentGain] = motor_parameter[parameter_table[Version]].Kp_Current;
     parameter_table[CurrentIntegral] = motor_parameter[parameter_table[Version]].Ki_Current;
     parameter_table[SpeedGain] = motor_parameter[parameter_table[Version]].Kp_Speed;
     parameter_table[SpeedIntegral] = motor_parameter[parameter_table[Version]].Ki_Speed;
     //angle_init(&angle_parameter);
}





















// fpga
//fpga fpga_parameter = fpga_default;

//***************************************显示和按键变量*************************

//u16 key_value;
//u16 key_value_pre;

//******************************************************************************



//key采集时间
//u32 keydelay=0;





